<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.AdobeCreativeCloudInstaller</string>
	<key>Input</key>
	<dict>
		<key>BETA_GROUP_NAME</key>
		<string>update-smart-%NAME%-beta</string>
		<key>BETA_GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplateBetapatch.xml</string>
		<key>CATEGORY</key>
		<string>Autopkg</string>
		<key>GROUP_NAME</key>
		<string>Update-Smart-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplateAutopatch.xml</string>
		<key>NAME</key>
		<string>Creative Cloud</string>
		<key>POLICY_CATEGORY</key>
		<string>Autopkg</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplateAutopatch2.xml</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;https://ccmdl.adobe.com/AdobeProducts/KCCC/CCD/.*?/osx10/ACCC.*?.dmg)</string>
		<key>SEARCH_URL</key>
		<string>https://helpx.adobe.com/download-install/kb/creative-cloud-desktop-app-download.html</string>
		<key>SELFSERVPOLICYBETA_CATEGORY</key>
		<string>*Updates For Testers*</string>
		<key>SELFSERVPOLICYBETA_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplateSelfServe.beta.xml</string>
		<key>SELFSERVPOLICY_CATEGORY</key>
		<string>*Updates for You*</string>
		<key>SELFSERVPOLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplateSelfServe.all.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Access Adobe apps from the cloud with a monthly fee.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>AdobeCreativeCloudInstaller.png</string>
		<key>SOFTWARETITLE</key>
		<string>AdobeCC</string>
		<key>VENDOR</key>
		<string>Adobe</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.AdobeCreativeCloudInstaller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%BETA_GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%BETA_GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>policy_category</key>
				<string>%SELFSERVPOLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string></string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Comment</key>
			<string>just a beta group but unrelated</string>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%BETA_GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string></string>
					</dict>
				</array>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>policy_category</key>
				<string>%SELFSERVPOLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%SELFSERVPOLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Comment</key>
			<string>Self Service install policy for all, group is nulled</string>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%BETA_GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string></string>
					</dict>
				</array>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>policy_category</key>
				<string>%SELFSERVPOLICYBETA_CATEGORY%</string>
				<key>policy_template</key>
				<string>%SELFSERVPOLICYBETA_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Comment</key>
			<string>Self Service install policy for testers only, group is nulled</string>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
