<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.CloudApp</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>uk.co.dataJAR.CloudApp</string>
		<key>CATEGORY</key>
		<string>Autopkg</string>
		<key>GROUP_NAME</key>
		<string>update-smart-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplateAutopatch.xml</string>
		<key>NAME</key>
		<string>CloudApp</string>
		<key>POLICY_CATEGORY</key>
		<string>Autopkg</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplateAutopatch2.xml</string>
		<key>PROD_NAME</key>
		<string>CloudApp</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>CloudApp screen recorder software for Mac and PC. Record video, webcam, GIFs, capture your screen and share it instantly to the cloud</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>SOFTWARETITLE</key>
		<string>CloudApp</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://d2plwz9jdz9z5d.cloudfront.net/mac/latest/appcast.xml</string>
		<key>prod_name</key>
		<string>CloudApp</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.jss.CloudApp</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.download.CloudApp</key>
			<dict>
				<key>git_hash</key>
				<string>a300b0a78dc01755dae70113a255f7f3c5f48e8d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/CloudApp/CloudApp.download.recipe</string>
				<key>sha256_hash</key>
				<string>32959ff65915d7f3c7f7a9727b7c91b15b611bf6bd55b5743e183fde64ca82c6</string>
			</dict>
			<key>com.github.dataJAR-recipes.jss.CloudApp</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/CloudApp/CloudApp.jss.recipe</string>
				<key>sha256_hash</key>
				<string>7b3786de5d041c2171aa9eef24de939c6c37c43f82f1b6881d7ed35541c06368</string>
			</dict>
			<key>com.github.dataJAR-recipes.pkg.CloudApp</key>
			<dict>
				<key>git_hash</key>
				<string>a300b0a78dc01755dae70113a255f7f3c5f48e8d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/CloudApp/CloudApp.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>06363fd9d5d475280fcc675bac4a3b035c1fd18740127c4723c516becf8e8815</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
