<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Firefox</string>
	<key>Input</key>
	<dict>
		<key>BETA_GROUP_NAME</key>
		<string>update-smart-%NAME%-beta</string>
		<key>BETA_GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplateBetapatch.xml</string>
		<key>SELFSERVPOLICY_CATEGORY</key>
		<string>Misc. Apps</string>
		<key>SELFSERVPOLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTempalteSelfServe.beta.xml</string>
<key>CATEGORY</key>
		<string>Autopkg</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false />
		<key>GROUP_NAME</key>
		<string>Update-Smart-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplateAutopatch.xml</string>
		<key>LOCALE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x,10.9.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Autopkg</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplateAutopatch2.xml</string>
		<key>SOFTWARETITLE</key>
		<string>Firefox</string>
		<key>RELEASE</key>
		<string>latest</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Mozilla Firefox is a free and open source web browser.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Firefox.png</string>
	</dict>
	<!-- cleaned -->

	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Firefox_EN</string>
	
	<key>Process</key>
	<array>




<!-- dict1 -->
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
<!-- groups are nested or recursion mess not related to policy -->
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
<!-- dict2 -->
		<dict>
			<key>Arguments</key>
			<dict>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%BETA_GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%BETA_GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>policy_category</key>
				<string>%SELFSERVPOLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%SELFSERVPOLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Comment</key>
			<string>Self Service install policy, also makes a beta group but unrelated</string>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
	


</dict>
</plist>
