<policy>
    <general>
        <!-- Enable ID or Name for a Site-based Policy
        <site>
            <id>%site_id%</id>
            <name>%site_name%</name>
        </site> -->
        <name>Self Serv Beta Latest %PROD_NAME%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <category>
            <name>%policy_category%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by zackn9ne-->
        <all_computers>false</all_computers>
        <computers/>
        <computer_groups>
            <computer_group>
                <name>update-smart-%PROD_NAME%-beta</name>
            </computer_group>
        </computer_groups>
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <!--Icons added by JSSImporter-->
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install %VERSION%</install_button_text>
        <reinstall_button_text>Install %VERSION%</reinstall_button_text>
        <self_service_display_name>Install %PROD_NAME%</self_service_display_name>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <user_interaction>
        <message_start>%MESSAGE_START%</message_start>
        <message_finish>%MESSAGE_FINISH%</message_finish>
    </user_interaction>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
