<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Zeplin</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>io.zeplin.osx</string>
		<key>CATEGORY</key>
		<string>Autopkg</string>
		<key>GROUP_NAME</key>
		<string>Update-Smart-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplateAutopatch.xml</string>
		<key>SOFTWARETITLE</key>
		<string>Zeplin</string>
		<key>NAME</key>
		<string>Zeplin</string>
		<key>POLICY_CATEGORY</key>
		<string>Autopkg</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplateAutopatch2.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string></string>
		<key>SELF_SERVICE_ICON</key>
		<string>Zeplin.png</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://rink.hockeyapp.net/api/2/apps/8926efffe734b6d303d09f41d90c34fc</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mosen.jss.Zeplin</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.hobbithardcase.download.Zeplin</key>
			<dict>
				<key>git_hash</key>
				<string>e513574ac90a394016a4ee2429e074a22b1fa777</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.HobbitHardcase-recipes/Zeplin/Zeplin.download.recipe</string>
				<key>sha256_hash</key>
				<string>b515a082ebd3eb6e9cab5d313a5c7021d49f923e59518dc8fa88194f87fd5105</string>
			</dict>
			<key>com.github.hobbithardcase.pkg.Zeplin</key>
			<dict>
				<key>git_hash</key>
				<string>e513574ac90a394016a4ee2429e074a22b1fa777</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.HobbitHardcase-recipes/Zeplin/Zeplin.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>a77c12620175463c35720321d34807d01acd686bb4a03a3be938934f2a0f0f62</string>
			</dict>
			<key>com.github.mosen.jss.Zeplin</key>
			<dict>
				<key>git_hash</key>
				<string>0cb9896c45e22eb01f6ab5d9bf2700482abce84c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.mosen-recipes/Zeplin/Zeplin.jss.recipe</string>
				<key>sha256_hash</key>
				<string>5d10de7c9d2b93996f17724b6d0a2a8cb4e6f959e5ca11211d18a41f666a0ce3</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
